АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеруПропарки/алк_ЗагрузкаВКамеруПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗагрузкаВКамеруПропарки</name>
  <registerRecords>AccumulationRegister.алк_УчетВремениПропарки</registerRecords>
  <registerRecords>InformationRegister.алк_СтатусПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиВКамерахПропарки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.алк_СменыШпон</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КамераПропарки</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапускаКамеры</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативПропарки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдётЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрадацияПропарки</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативноеВремяПропарки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПериодыСезоновПропарки/алк_ПериодыСезоновПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПериодыСезоновПропарки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </resources>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_НормативыПропарки/алк_НормативыПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_НормативыПропарки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НормативПропарки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормативЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Градация</name>
    <type>
      <types>CatalogRef.алк_ГрадацияПропарки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_СезоныПропарки/алк_СезоныПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_СезоныПропарки</name>
  <enumValues>
    <name>Лето</name>
  </enumValues>
  <enumValues>
    <name>Зима</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/Смены/Смены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Смены</name>
  <enumValues>
    <name>смена_8_20</name>
  </enumValues>
  <enumValues>
    <name>смена_20_8</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеруПропарки/Forms/ФормаДокумента/Module.bsl
// кнопки времени 
 
&НаКлиенте
Процедура НачалоЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ВызовФормыВремени(Объект.НачалоЗагрузки, "НачалоЗагрузки");	
	
КонецПроцедуры
&НаКлиенте
Процедура НачалоЗагрузкиПриИзменении(Элемент) 
	
	ПараметрыВремени = Новый Структура;
	ПараметрыВремени.Вставить("ИмяРеквизита", "НачалоЗагрузки"); 

	ВводВремениЗавершено(Объект.НачалоЗагрузки, ПараметрыВремени);
     	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ВызовФормыВремени(Объект.ОкончаниеЗагрузки, "ОкончаниеЗагрузки");
КонецПроцедуры
&НаКлиенте
Процедура ОкончаниеЗагрузкиПриИзменении(Элемент)
	
	ПараметрыВремени = Новый Структура;
	ПараметрыВремени.Вставить("ИмяРеквизита", "ОкончаниеЗагрузки"); 

	ВводВремениЗавершено(Объект.НачалоЗагрузки, ПараметрыВремени);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяЗапускаКамерыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ВызовФормыВремени(Объект.ВремяЗапускаКамеры, "ВремяЗапускаКамеры");
КонецПроцедуры
&НаКлиенте
Процедура ВремяЗапускаКамерыПриИзменении(Элемент)
	
	ПараметрыВремени = Новый Структура;
	ПараметрыВремени.Вставить("ИмяРеквизита", "ВремяЗапускаКамеры"); 

	ВводВремениЗавершено(Объект.ВремяЗапускаКамеры, ПараметрыВремени);
	
КонецПроцедуры 



&НаКлиенте
Процедура ВызовФормыВремени(ДатаВремя, ИмяРеквизита)
	
	ПараметрыВремени = Новый Структура;
	ПараметрыВремени.Вставить("ДатаВремя", ДатаВремя);
	ПараметрыВремени.Вставить("ИмяРеквизита", ИмяРеквизита);

	ОписаниеОповещения = Новый ОписаниеОповещения("ВводВремениЗавершено", ЭтотОбъект, ПараметрыВремени);
	                                                // форма,  				Параметры, Владелец,      Уникальность      Окно НавигационнаяСсылка      
	ОткрытьФорму("Документ.алк_ЗагрузкаВКамеруПропарки.Форма.ФормаВводаВремени", ПараметрыВремени, ЭтаФорма,УникальныйИдентификатор,    , 					, ОписаниеОповещения,);
		
КонецПроцедуры

&НаКлиенте
Процедура ВводВремениЗавершено(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	РезультатЗакрытия = НачалоМинуты(РезультатЗакрытия);
	
	Если ДополнительныеПараметры.Свойство("ИмяРеквизита") Тогда  		
		
		Объект[ДополнительныеПараметры.ИмяРеквизита] = РезультатЗакрытия;
		
		Если ДополнительныеПараметры.ИмяРеквизита = "НачалоЗагрузки" Тогда
			
			Объект.Дата = РезультатЗакрытия; 
			
			Объект.Сезон = ПолучитьСезон(Объект.НачалоЗагрузки);
			
			Объект.НормативЗагрузки = ПолучитьНормативЗагрузки(Объект.НачалоЗагрузки, Объект.Сезон);
			
			Если Не ЗначениеЗаполнено(Объект.ОкончаниеЗагрузки) Тогда 		
				Объект.ОкончаниеЗагрузки = Объект.НачалоЗагрузки;	
			КонецЕсли;   
			
			Если Не ЗначениеЗаполнено(Объект.ВремяЗапускаКамеры) Тогда 		
				Объект.ВремяЗапускаКамеры = Объект.НачалоЗагрузки;	
			КонецЕсли; 
			
		КонецЕсли;
		
		Если ДополнительныеПараметры.ИмяРеквизита = "ОкончаниеЗагрузки" Тогда
			Если Не ЗначениеЗаполнено(Объект.ВремяЗапускаКамеры) Или Объект.НачалоЗагрузки = Объект.ВремяЗапускаКамеры Тогда 		
				Объект.ВремяЗапускаКамеры = Объект.ОкончаниеЗагрузки;	
			КонецЕсли;	
		КонецЕсли;

	КонецЕсли;        
			
	Модифицированность = Истина;
	
КонецПроцедуры // ВызовФормыВремени()


////////////////////////////

&НаКлиенте
Процедура НоменклатураГрадацияПропаркиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Номенклатура.ТекущиеДанные;
	
	ТекущиеДанные.НормативноеВремяПропарки = ПолучитьНормативПропарки(Объект.Дата, Объект.Сезон, ТекущиеДанные.ГрадацияПропарки);
	
	
	МаксимальныйНормативПропарки = 0;	
	
	Для каждого Стр Из Объект.Номенклатура Цикл
		
		Если МаксимальныйНормативПропарки < Стр.НормативноеВремяПропарки Тогда
			МаксимальныйНормативПропарки = Стр.НормативноеВремяПропарки;
		КонецЕсли;	
	
	КонецЦикла;
	
	Объект.НормативПропарки = МаксимальныйНормативПропарки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСезон(ДатаСреза)
	
	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = ТекущаяДата();	
	КонецЕсли; 

	Сезон = Перечисления.алк_СезоныПропарки.Лето;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПериодыСезоновПропаркиСрезПоследних.Сезон
		|ИЗ
		|	РегистрСведений.алк_ПериодыСезоновПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_ПериодыСезоновПропаркиСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сезон = ВыборкаДетальныеЗаписи.Сезон;
	КонецЦикла;
	
	Возврат Сезон;

КонецФункции // ПолучитьСезон()

&НаСервереБезКонтекста
Функция ПолучитьНормативЗагрузки(ДатаСреза, Сезон)  
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
		|ИЗ
		|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_НормативыПропаркиСрезПоследних
		|ГДЕ
		|	алк_НормативыПропаркиСрезПоследних.Сезон = &Сезон";
	
	Запрос.УстановитьПараметр("ДатаСреза", 	ДатаСреза);
	Запрос.УстановитьПараметр("Сезон", 		Сезон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Норматив = ВыборкаДетальныеЗаписи.НормативЗагрузки; 
	КонецЦикла;
	
	Возврат Норматив;
    	
КонецФункции // ПолучитьНормативЗагрузки()

 &НаСервереБезКонтекста
Функция ПолучитьНормативПропарки(ДатаСреза, Сезон, Градация)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_НормативыПропаркиСрезПоследних.НормативПропарки,
		|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
		|ИЗ
		|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_НормативыПропаркиСрезПоследних
		|ГДЕ
		|	алк_НормативыПропаркиСрезПоследних.Градация = &Градация
		|	И алк_НормативыПропаркиСрезПоследних.Сезон = &Сезон";
	
	Запрос.УстановитьПараметр("Градация", 	Градация);
	Запрос.УстановитьПараметр("ДатаСреза", 	ДатаСреза);
	Запрос.УстановитьПараметр("Сезон", 		Сезон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НормативПропарки = ВыборкаДетальныеЗаписи.НормативПропарки;
	КонецЦикла;
	
	Возврат НормативПропарки;

КонецФункции // ПолучитьНормативПропарки()

&НаКлиенте
Процедура СменаПриИзменении(Элемент)  

	Объект.Дата = Объект.ДатаСмены + ?(Объект.Смена = ПредопределенноеЗначение("Перечисление.Смены.смена_8_20"), 3600*8, 3600*20); 	
	Объект.ДатаОкончанияСмены = Объект.Дата + (12*3600 - 1);        	
	
КонецПроцедуры
